{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e834969b-9baa-4727-9a07-0a45956c13b9",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "#!pip install crewai crewai_tools langchain==0.2.6 langchain-core==0.2.15 langchain-experimental==0.0.62 langchain-community==0.2.6 langchain_mistralai"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a91f36c8-049d-4794-a435-faa081b742ba",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "codestral-latest https://codestral.mistral.ai/v1/\n"
     ]
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "local=True\n",
    "load_dotenv(\".env_generic\")\n",
    "load_dotenv(\".env_neo4j_local\")\n",
    "model_file=\".env_mistal_ai\"\n",
    "if (local):\n",
    "    model_file=\".env_ollama\"\n",
    "    model_file=\".env_codestral\" \n",
    "load_dotenv(model_file)\n",
    "print(os.getenv('OPENAI_MODEL_NAME'),os.getenv('OPENAI_API_BASE'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "2cdecb3e-8333-437e-938f-8ad74f28efe9",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (b:IfcBuildingStorey)\n",
      "RETURN COUNT(b)\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'COUNT(b)': 12}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I'm not able to determine the number of floors based on the provided information. The information provided is about a count of 12, but it's not specified what that count refers to. Without more context or information, I can't accurately answer the question about the number of floors.\""
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain_openai import ChatOpenAI\n",
    "from langchain.agents import Tool\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain.chains.graph_qa.cypher import GraphCypherQAChain\n",
    "import os\n",
    "graph = Neo4jGraph(url=os.environ['NEO4J_URI'], username=os.environ['NEO4J_USERNAME'], password=os.environ['NEO4J_PASSWORD'])\n",
    "graph.refresh_schema()\n",
    "llm = ChatOpenAI(model=os.getenv('OPENAI_MODEL_NAME'), temperature=0)\n",
    "#llm = ChatOpenAI(model=os.getenv('OPENAI_MODEL_NAME'), temperature=0)\n",
    "neo4jquery = GraphCypherQAChain.from_llm(\n",
    "    llm, graph=graph, verbose=True\n",
    ")\n",
    "CYPHER_GENERATION_PROMPT=\"\"\"you must use only entities that you see in the schema. dont invent anything. you must try mode than five times few different approaches before you give up and return with no result\"\"\"\n",
    "neo4j_query_tool = Tool(\n",
    "  name=\"neo4j_query_tool\",\n",
    "  func=neo4jquery.run,\n",
    "  description=\"neo4j database that contains data about the project, user provide english question the tool translates it to query and respond with the answer\",\n",
    "  cypher_prompt=CYPHER_GENERATION_PROMPT\n",
    ")\n",
    "neo4j_query_tool.run(\"how many floors are there?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "a033ea47-5495-4bd5-a0bd-28bc9c7d98b0",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-07-23 19:49:53,435 - 140704580679424 - __init__.py-__init__:518 - WARNING: Overriding of current TracerProvider is not allowed\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[1m\u001b[95m [2024-07-23 19:49:53][DEBUG]: == Working Agent: civil engineer\u001b[00m\n",
      "\u001b[1m\u001b[95m [2024-07-23 19:49:53][INFO]: == Starting Task: the data is about building, need to get list of walls and all the information you have on the material they are made of sometimes the type of the bricks can be concluded from the Name property of the wall. for example, wall named 'Basic Wall:Concrete 24', means that its made of Concrete 24 brick  if you dont find the full data provide list of walls you did find the data you must try mode than five times few different approaches before you give up\u001b[00m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new CrewAgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mI will first ask the neo4j_query_tool to provide me with a list of all the walls in the database. Then, I will try to extract the type of material from the properties of each wall, specifically focusing on the 'Name' property as it often contains information about the brick type.\n",
      "\n",
      "Action: neo4j_query_tool\n",
      "Action Input: {\"tool_input\": \"MATCH (w:Wall) RETURN w.Name AS WallName, w.Type AS WallType\"}\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (w:IfcWall) RETURN w.Name AS WallName, w.ObjectType AS WallType\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'WallName': 'Basic Wall:Concrete 12\":585306', 'WallType': 'Basic Wall:Concrete 12\"'}, {'WallName': 'Basic Wall:Concrete 18\":936763', 'WallType': 'Basic Wall:Concrete 18\"'}, {'WallName': 'Basic Wall:Concrete 18\":936762', 'WallType': 'Basic Wall:Concrete 18\"'}, {'WallName': 'Basic Wall:Concrete 24\":935927', 'WallType': 'Basic Wall:Concrete 24\"'}, {'WallName': 'Basic Wall:Concrete 18\":935926', 'WallType': 'Basic Wall:Concrete 18\"'}, {'WallName': 'Basic Wall:Concrete 18\":935925', 'WallType': 'Basic Wall:Concrete 18\"'}, {'WallName': 'Basic Wall:Concrete 18\":935924', 'WallType': 'Basic Wall:Concrete 18\"'}, {'WallName': 'Basic Wall:Concrete 18\":935923', 'WallType': 'Basic Wall:Concrete 18\"'}, {'WallName': 'Basic Wall:Concrete 18\":935922', 'WallType': 'Basic Wall:Concrete 18\"'}, {'WallName': 'Basic Wall:Concrete 18\":691311', 'WallType': 'Basic Wall:Concrete 18\"'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\u001b[95m \n",
      "\n",
      "Based on the provided information, the query \"MATCH (w:Wall) RETURN w.Name AS WallName, w.Type AS WallType\" would return the following results:\n",
      "\n",
      "1. WallName: 'Basic Wall:Concrete 12\"', WallType: 'Basic Wall:Concrete 12\"'\n",
      "2. WallName: 'Basic Wall:Concrete 18\"', WallType: 'Basic Wall:Concrete 18\"'\n",
      "3. WallName: 'Basic Wall:Concrete 18\"', WallType: 'Basic Wall:Concrete 18\"'\n",
      "4. WallName: 'Basic Wall:Concrete 24\"', WallType: 'Basic Wall:Concrete 24\"'\n",
      "5. WallName: 'Basic Wall:Concrete 18\"', WallType: 'Basic Wall:Concrete 18\"'\n",
      "6. WallName: 'Basic Wall:Concrete 18\"', WallType: 'Basic Wall:Concrete 18\"'\n",
      "7. WallName: 'Basic Wall:Concrete 18\"', WallType: 'Basic Wall:Concrete 18\"'\n",
      "8. WallName: 'Basic Wall:Concrete 18\"', WallType: 'Basic Wall:Concrete 18\"'\n",
      "9. WallName: 'Basic Wall:Concrete 18\"', WallType: 'Basic Wall:Concrete 18\"'\n",
      "10. WallName: 'Basic Wall:Concrete 18\"', WallType: 'Basic Wall:Concrete 18\"'\n",
      "\n",
      "These are the names and types of the walls based on the information provided.\n",
      "\u001b[00m\n",
      "\u001b[32;1m\u001b[1;3m\u001b[0m\u001b[32;1m\u001b[1;3mThought: I will correct my mistake and restart. I will use the neo4j_query_tool to provide me with a list of all the walls in the database. Since the 'Type' property seems to be the same as the 'Name' property, I will focus on extracting the material type from the 'Name' property.\n",
      "\n",
      "Action: neo4j_query_tool\n",
      "Action Input: {\"tool_input\": \"MATCH (w:Wall) RETURN w.Name AS WallName\"}\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (w:IfcWall) RETURN w.Name AS WallName\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'WallName': 'Basic Wall:Concrete 12\":585306'}, {'WallName': 'Basic Wall:Concrete 18\":936763'}, {'WallName': 'Basic Wall:Concrete 18\":936762'}, {'WallName': 'Basic Wall:Concrete 24\":935927'}, {'WallName': 'Basic Wall:Concrete 18\":935926'}, {'WallName': 'Basic Wall:Concrete 18\":935925'}, {'WallName': 'Basic Wall:Concrete 18\":935924'}, {'WallName': 'Basic Wall:Concrete 18\":935923'}, {'WallName': 'Basic Wall:Concrete 18\":935922'}, {'WallName': 'Basic Wall:Concrete 18\":691311'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\u001b[95m \n",
      "\n",
      "Based on the provided information, the names of the walls are:\n",
      "\n",
      "1. Basic Wall:Concrete 12\"\n",
      "2. Basic Wall:Concrete 18\"\n",
      "3. Basic Wall:Concrete 18\"\n",
      "4. Basic Wall:Concrete 24\"\n",
      "5. Basic Wall:Concrete 18\"\n",
      "6. Basic Wall:Concrete 18\"\n",
      "7. Basic Wall:Concrete 18\"\n",
      "8. Basic Wall:Concrete 18\"\n",
      "9. Basic Wall:Concrete 18\"\n",
      "10. Basic Wall:Concrete 18\"\n",
      "\n",
      "These are the wall names that match the query in your question.\n",
      "\u001b[00m\n",
      "\u001b[32;1m\u001b[1;3mThought:\n",
      "I now have the names of the walls. I can extract the material type from these names by splitting them on the ':' character and taking the second part. This assumes that the material type is always after the ':' character in the name.\n",
      "\n",
      "Final Answer:\n",
      "\n",
      "1. Wall Name: Basic Wall:Concrete 12\", Material Type: Concrete 12\"\n",
      "2. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "3. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "4. Wall Name: Basic Wall:Concrete 24\", Material Type: Concrete 24\"\n",
      "5. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "6. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "7. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "8. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "9. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "10. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "\n",
      "These are the walls in the database, each listed with their name and the material type they are made of. The material type was extracted from the name of the wall, assuming that it is always after the ':' character.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\u001b[1m\u001b[92m [2024-07-23 19:50:22][DEBUG]: == [civil engineer] Task output: 1. Wall Name: Basic Wall:Concrete 12\", Material Type: Concrete 12\"\n",
      "2. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "3. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "4. Wall Name: Basic Wall:Concrete 24\", Material Type: Concrete 24\"\n",
      "5. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "6. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "7. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "8. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "9. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "10. Wall Name: Basic Wall:Concrete 18\", Material Type: Concrete 18\"\n",
      "\n",
      "These are the walls in the database, each listed with their name and the material type they are made of. The material type was extracted from the name of the wall, assuming that it is always after the ':' character.\n",
      "\n",
      "\u001b[00m\n",
      "\u001b[1m\u001b[95m [2024-07-23 19:50:22][DEBUG]: == Working Agent: senior civil engineer\u001b[00m\n",
      "\u001b[1m\u001b[95m [2024-07-23 19:50:22][INFO]: == Starting Task: supervise any step that the civil engineer is doing, and cross validate he does descent job. i if he does mistake, correct him and ask him to do again with your hints, the chain should not be stopped till final correct answer is submitted sometimes the type of the bricks can be concluded from the Name property of the wall. for example, wall named 'Basic Wall:Concrete 24', means that its made of Concrete 24 brick \u001b[00m\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new CrewAgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mI need to check if the material types listed for each wall in the database are correct based on the wall name. Since the material type is assumed to be after the ':' character in the wall name, I will use the neo4j_query_tool to confirm this.\n",
      "\n",
      "Action: neo4j_query_tool\n",
      "Action Input: {\"tool_input\": \"Return all walls with their names and the material type extracted from the name.\"}\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (w:IfcWall)\n",
      "WHERE w.Name CONTAINS 'Material'\n",
      "RETURN w.Name, SPLIT(w.Name, 'Material')[1] AS MaterialType\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\u001b[95m \n",
      "\n",
      "I'm sorry, but I don't have enough information to provide a detailed answer. I can't list the walls with their names and the material type extracted from the name without any data to analyze. Could you please provide more details or context?\n",
      "\u001b[00m\n",
      "\u001b[32;1m\u001b[1;3mIt seems there is a mistake in my previous response. I don't have actual data to analyze, but I can guide you on how to use the tool to verify the data provided.\n",
      "\n",
      "Since the material type is assumed to be after the ':' character in the wall name, you can use the neo4j_query_tool to confirm this. I suggest running a query to get the wall names and their corresponding material types.\n",
      "\n",
      "Action: neo4j_query_tool\n",
      "Action Input: {\"tool_input\": \"Return all walls with their IDs and the substring of their names after the ':' character.\"}\n",
      "\u001b[0m\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (w:IfcWall)\n",
      "RETURN w.nid AS id, split(w.Name, ':')[1] AS name_substring\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'id': 1573, 'name_substring': 'Concrete 12\"'}, {'id': 176691, 'name_substring': 'Concrete 18\"'}, {'id': 176618, 'name_substring': 'Concrete 18\"'}, {'id': 176547, 'name_substring': 'Concrete 24\"'}, {'id': 176481, 'name_substring': 'Concrete 18\"'}, {'id': 176403, 'name_substring': 'Concrete 18\"'}, {'id': 176324, 'name_substring': 'Concrete 18\"'}, {'id': 176097, 'name_substring': 'Concrete 18\"'}, {'id': 175866, 'name_substring': 'Concrete 18\"'}, {'id': 57268, 'name_substring': 'Concrete 18\"'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\u001b[95m \n",
      "\n",
      "Sure, here are the walls with their IDs and the substrings of their names after the ':' character:\n",
      "\n",
      "1. Wall ID: 1573, Name Substring: 'Concrete 12\"'\n",
      "2. Wall ID: 176691, Name Substring: 'Concrete 18\"'\n",
      "3. Wall ID: 176618, Name Substring: 'Concrete 18\"'\n",
      "4. Wall ID: 176547, Name Substring: 'Concrete 24\"'\n",
      "5. Wall ID: 176481, Name Substring: 'Concrete 18\"'\n",
      "6. Wall ID: 176403, Name Substring: 'Concrete 18\"'\n",
      "7. Wall ID: 176324, Name Substring: 'Concrete 18\"'\n",
      "8. Wall ID: 176097, Name Substring: 'Concrete 18\"'\n",
      "9. Wall ID: 175866, Name Substring: 'Concrete 18\"'\n",
      "10. Wall ID: 57268, Name Substring: 'Concrete 18\"'\n",
      "\u001b[00m\n",
      "\u001b[32;1m\u001b[1;3mThe data provided by the engineer is correct based on the analysis. All the walls are made of the concrete material type that matches the name of the wall after the ':' character. Therefore, the findings are as follows:\n",
      "\n",
      "```json\n",
      "[\n",
      "  {\"wall_id\": 1573, \"material_type\": \"Concrete 12\\\"\"},\n",
      "  {\"wall_id\": 176691, \"material_type\": \"Concrete 18\\\"\"},\n",
      "  {\"wall_id\": 176618, \"material_type\": \"Concrete 18\\\"\"},\n",
      "  {\"wall_id\": 176547, \"material_type\": \"Concrete 24\\\"\"},\n",
      "  {\"wall_id\": 176481, \"material_type\": \"Concrete 18\\\"\"},\n",
      "  {\"wall_id\": 176403, \"material_type\": \"Concrete 18\\\"\"},\n",
      "  {\"wall_id\": 176324, \"material_type\": \"Concrete 18\\\"\"},\n",
      "  {\"wall_id\": 176097, \"material_type\": \"Concrete 18\\\"\"},\n",
      "  {\"wall_id\": 175866, \"material_type\": \"Concrete 18\\\"\"},\n",
      "  {\"wall_id\": 57268, \"material_type\": \"Concrete 18\\\"\"}\n",
      "]\n",
      "```\n",
      "\n",
      "Thought: I now know the final answer\n",
      "Final Answer: The findings provided by the engineer with approval. All the walls are made of the concrete material type that matches the name of the wall after the ':'. The final results are provided in JSON format.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "\u001b[1m\u001b[92m [2024-07-23 19:50:41][DEBUG]: == [senior civil engineer] Task output: The findings provided by the engineer with approval. All the walls are made of the concrete material type that matches the name of the wall after the ':'. The final results are provided in JSON format.\n",
      "\n",
      "\u001b[00m\n"
     ]
    }
   ],
   "source": [
    "# Agent 1: Researcher\n",
    "from crewai import Agent, Task, Crew\n",
    "analyst = Agent(\n",
    "    role=\"civil engineer\",\n",
    "    goal=\"get information about materials from data tool you ask the tool the questions in human language\",\n",
    "    tools = [  neo4j_query_tool],\n",
    "    verbose=True,\n",
    "    backstory=(\n",
    "        \"As civil engineer, you get your input from the neo4j_query_tool, you ask the questions in human language, for example, if you want to know number of floors you ask : how many floors are there? \"\n",
    "        \"you might need to calculate things by yourself, according to the data you get from the tool. you are providing quantities of materials needed. for example: number of bricks of each kind \"\n",
    "        \"you must be very accurate and dont miss anything. dont invent anything. you must get approval from senior civil engineer, before submitting the answer. you can also consult with him for any issue \"\n",
    "        \"if the supervisor is wrong, tell him he is wrong\"\n",
    "    )\n",
    ")\n",
    "senior = Agent(\n",
    "    role=\"senior civil engineer\",\n",
    "    goal=\"validate that the civil engineer is doing proper work. \",\n",
    "    tools = [  neo4j_query_tool],\n",
    "    verbose=True,\n",
    "    backstory=(\n",
    "        \"As senior civil engineer, you are validating that the data provided by the engineer is correct. beaware that he has the tendency to miss thing and invent things. \"\n",
    "        \"This is not acceptable, and you must follow each step he does and make sure it was correct. he can consult with you when needed, you are guru in IFC and very experienced\"\n",
    "    )\n",
    ")\n",
    "\n",
    "\n",
    "\n",
    "# Task for Researcher Agent:\n",
    "analyst_task = Task(\n",
    "    description=(\n",
    "        \"the data is about building, need to get list of walls and all the information you have on the material they are made of \" \n",
    "        \"sometimes the type of the bricks can be concluded from the Name property of the wall. for example, wall named 'Basic Wall:Concrete 24', means that its made of Concrete 24 brick \"\n",
    "        \" if you dont find the full data provide list of walls you did find the data \"\n",
    "        \"you must try mode than five times few different approaches before you give up\"\n",
    "    ),\n",
    "    expected_output=(\n",
    "        \"list of walls, each wall separately with duplications,  their type (for example concrete 11 )\"\n",
    "    ),\n",
    "    agent=analyst,\n",
    "    async_execution=False\n",
    ")\n",
    "\n",
    "senior_task = Task(\n",
    "    description=(\n",
    "        \"supervise any step that the civil engineer is doing, and cross validate he does descent job. i \"\n",
    "        \"if he does mistake, correct him and ask him to do again with your hints, the chain should not be stopped till final correct answer is submitted \"\n",
    "        \"sometimes the type of the bricks can be concluded from the Name property of the wall. for example, wall named 'Basic Wall:Concrete 24', means that its made of Concrete 24 brick \"\n",
    "    ),\n",
    "    expected_output=(\n",
    "        \"The findings provided by the civil engineer with your approval, in json format, having the wall id and its type\"\n",
    "    ),\n",
    "    agent=senior,\n",
    "    async_execution=False\n",
    ")\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "application_crew = Crew(\n",
    "    agents=[analyst, senior],\n",
    "\n",
    "    tasks=[analyst_task,senior_task ],\n",
    "\n",
    "    verbose=True\n",
    ")\n",
    "result = application_crew.kickoff()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4fe201b5-b617-4a66-994c-fd559095e831",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "#from langchain_mistralai.chat_models import ChatMistralAI\n",
    "#llm = ChatMistralAI(api_key=\"YeBPYL5uYm1mZtYI8d0iAoN7Hwajwd2I\", base_url=\"https://codestral.mistral.ai/v1/fim/completions\",model=\"codestral-latest\",temperature=0)\n",
    "#import requests\n",
    "# Define the non-default URL\n",
    "#api_url = 'https://codestral.mistral.ai/v1/chat/completions'\n",
    "# Setup the request headers and data\n",
    "#headers = {\n",
    "#    'Authorization': 'Bearer ',\n",
    "#    'Content-Type': 'application/json'\n",
    "#}\n",
    "#data = {\n",
    "#    'model': 'codestral-latest',\n",
    "#    'messages': [\n",
    "#        {'role': 'user', 'content': 'What is the best French cheese?'}\n",
    "#    ]\n",
    "#}\n",
    "\n",
    "# Make the POST request to the non-default URL\n",
    "#response = requests.post(api_url, headers=headers, json=data)\n",
    "\n",
    "# Print the response\n",
    "#print(response.json())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f52deb67-afa2-44fe-83db-46080f52b8ec",
   "metadata": {},
   "outputs": [],
   "source": [
    "#from langchain_mistralai.chat_models import ChatMistralAI\n",
    "#from langchain_core.messages import HumanMessage\n",
    "\n",
    "# Define the correct endpoint for the pre-GA model\n",
    "#endpoint = 'https://codestral.mistral.ai/v1/'\n",
    "\n",
    "# Initialize the ChatMistralAI client with the custom endpoint\n",
    "#chat = ChatMistralAI(api_key=os.environ['OPENAI_API_KEY'], model=os.getenv('OPENAI_MODEL_NAME'),endpoint = os.getenv('OPENAI_API_BASE') )\n",
    "# Define the messages to send\n",
    "#messages = [HumanMessage(content=\"knock knock\")]\n",
    "\n",
    "# Invoke the chat completion\n",
    "#response = chat.invoke(messages)\n",
    "\n",
    "# Print the response\n",
    "#print(response)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
